{
  "draft-posts": [
    {
      "id": "file-name",
      "title": "How to give folks opportunities to open up",
      "date": "TBD",
      "description": "Here's some text. And here's some more text.",
      "tags": []
    },
    {
      "id": "07-04-24-the-importance-of-introduction",
      "title": "The importance of the interview introduction",
      "date": "July 4, 2024",
      "description": "As interviewers, I believe we often overlook the importance of the first five minutes of an interview. It may feel tempting to 'not waste time' and 'get to the good stuff'. On the contrary, in my experience on both sides of the table, the success of the interview is heavily impacted by the tone we set at the start.",
      "tags": ["Design Thinking", "Technical Processes"]
    },
    {
      "id": "file-name",
      "title": "On finding your user base",
      "date": "TBD",
      "description": "On June 10th, I sent my first set of cold emails to the first user group I hope to serve. I was entering with a hypothesis and an open mind, but I admit I was still quite nervous. This was a fear I had to overcome, because, after months of work, I realized I was doing the product development process backwards.",
      "tags": []
    }
  ],
  "posts" : [
    {
      "id": "2024-7-13-on-embracing-ones-inner-critic",
      "title": "On embracing one's Inner Critic",
      "date": "July 13, 2024",
      "description": "After first starting this blog, I allowed it to sit dormant for almost a month. This was not because I wasn't writing, however. Instead, I was warring with my most frequent companion: my Inner Critic. Well no longer. I'm trying to befriend it instead.",
      "tags": ["Personal Development"]
    },
    {
      "id": "06-24-24-tips-for-needfinding-interviews",
      "title": "Five tips for conducting an strong needfinding interview",
      "date": "June 24, 2024",
      "description": "Needfinding interviews are the first step in building a product. Ideally, you do this before you write a line of code or draw a single screen of your spec. They can be incredibly valuable, presuming that they're structured well.",
      "tags": ["Design Thinking", "Product Development"]
    },
     {
      "id": "06-06-24-mm-data-the-first-hurdle",
      "title": "Data: The first 'Manuscript Mates' hurdle",
      "date": "June 6, 2024",
      "description": "Before I could begin with building Manuscript Mate, I needed to know if I could populate it. That proved to be tougher than expected.",
      "tags": ["Manuscript Mate", "Javascript"]
    },
    {
      "id": "06-05-24-hi-i-have-a-blog",
      "title": "Hi, I have a blog now.",
      "date": "June 5, 2024",
      "description": "It's about time.",
      "tags": ["Website Update"]
    }
  ],
  "tags": [
    "Website Update",
    "Manuscript Mate",
    "Javascript",
    "Design Thinking",
    "Product Development",
    "Technical Processes",
    "Personal Development"
  ]
}